garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f56q24.h
// Register: ADCG1B
#define ADCG1B ADCG1B
extern volatile unsigned char           ADCG1B              __at(0x111);
#ifndef _LIB_BUILD
asm("ADCG1B equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGB0                   :1;
        unsigned CGB1                   :1;
        unsigned CGB2                   :1;
        unsigned CGB3                   :1;
        unsigned CGB4                   :1;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
} ADCG1Bbits_t;
extern volatile ADCG1Bbits_t ADCG1Bbits __at(0x111);
// bitfield macros
#define _ADCG1B_CGB0_POSN                                   0x0
#define _ADCG1B_CGB0_POSITION                               0x0
#define _ADCG1B_CGB0_SIZE                                   0x1
#define _ADCG1B_CGB0_LENGTH                                 0x1
#define _ADCG1B_CGB0_MASK                                   0x1
#define _ADCG1B_CGB1_POSN                                   0x1
#define _ADCG1B_CGB1_POSITION                               0x1
#define _ADCG1B_CGB1_SIZE                                   0x1
#define _ADCG1B_CGB1_LENGTH                                 0x1
#define _ADCG1B_CGB1_MASK                                   0x2
#define _ADCG1B_CGB2_POSN                                   0x2
#define _ADCG1B_CGB2_POSITION                               0x2
#define _ADCG1B_CGB2_SIZE                                   0x1
#define _ADCG1B_CGB2_LENGTH                                 0x1
#define _ADCG1B_CGB2_MASK                                   0x4
#define _ADCG1B_CGB3_POSN                                   0x3
#define _ADCG1B_CGB3_POSITION                               0x3
#define _ADCG1B_CGB3_SIZE                                   0x1
#define _ADCG1B_CGB3_LENGTH                                 0x1
#define _ADCG1B_CGB3_MASK                                   0x8
#define _ADCG1B_CGB4_POSN                                   0x4
#define _ADCG1B_CGB4_POSITION                               0x4
#define _ADCG1B_CGB4_SIZE                                   0x1
#define _ADCG1B_CGB4_LENGTH                                 0x1
#define _ADCG1B_CGB4_MASK                                   0x10
#define _ADCG1B_CGB5_POSN                                   0x5
#define _ADCG1B_CGB5_POSITION                               0x5
#define _ADCG1B_CGB5_SIZE                                   0x1
#define _ADCG1B_CGB5_LENGTH                                 0x1
#define _ADCG1B_CGB5_MASK                                   0x20
#define _ADCG1B_CGB6_POSN                                   0x6
#define _ADCG1B_CGB6_POSITION                               0x6
#define _ADCG1B_CGB6_SIZE                                   0x1
#define _ADCG1B_CGB6_LENGTH                                 0x1
#define _ADCG1B_CGB6_MASK                                   0x40
#define _ADCG1B_CGB7_POSN                                   0x7
#define _ADCG1B_CGB7_POSITION                               0x7
#define _ADCG1B_CGB7_SIZE                                   0x1
#define _ADCG1B_CGB7_LENGTH                                 0x1
#define _ADCG1B_CGB7_MASK                                   0x80

// Register: ADCG1C
#define ADCG1C ADCG1C
extern volatile unsigned char           ADCG1C              __at(0x112);
#ifndef _LIB_BUILD
asm("ADCG1C equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned CGC2                   :1;
        unsigned                        :2;
        unsigned CGC5                   :1;
        unsigned CGC6                   :1;
    };
} ADCG1Cbits_t;
extern volatile ADCG1Cbits_t ADCG1Cbits __at(0x112);
// bitfield macros
#define _ADCG1C_CGC0_POSN                                   0x0
#define _ADCG1C_CGC0_POSITION                               0x0
#define _ADCG1C_CGC0_SIZE                                   0x1
#define _ADCG1C_CGC0_LENGTH                                 0x1
#define _ADCG1C_CGC0_MASK                                   0x1
#define _ADCG1C_CGC1_POSN                                   0x1
#define _ADCG1C_CGC1_POSITION                               0x1
#define _ADCG1C_CGC1_SIZE                                   0x1
#define _ADCG1C_CGC1_LENGTH                                 0x1
#define _ADCG1C_CGC1_MASK                                   0x2
#define _ADCG1C_CGC2_POSN                                   0x2
#define _ADCG1C_CGC2_POSITION                               0x2
#define _ADCG1C_CGC2_SIZE                                   0x1
#define _ADCG1C_CGC2_LENGTH                                 0x1
#define _ADCG1C_CGC2_MASK                                   0x4
#define _ADCG1C_CGC5_POSN                                   0x5
#define _ADCG1C_CGC5_POSITION                               0x5
#define _ADCG1C_CGC5_SIZE                                   0x1
#define _ADCG1C_CGC5_LENGTH                                 0x1
#define _ADCG1C_CGC5_MASK                                   0x20
#define _ADCG1C_CGC6_POSN                                   0x6
#define _ADCG1C_CGC6_POSITION                               0x6
#define _ADCG1C_CGC6_SIZE                                   0x1
#define _ADCG1C_CGC6_LENGTH                                 0x1
#define _ADCG1C_CGC6_MASK                                   0x40

// Register: ADCG1E
#define ADCG1E ADCG1E
extern volatile unsigned char           ADCG1E              __at(0x114);
#ifndef _LIB_BUILD
asm("ADCG1E equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGE0                   :1;
        unsigned CGE1                   :1;
        unsigned CGE2                   :1;
        unsigned CGE3                   :1;
        unsigned CGE4                   :1;
        unsigned CGE5                   :1;
        unsigned CGE6                   :1;
        unsigned CGE7                   :1;
    };
} ADCG1Ebits_t;
extern volatile ADCG1Ebits_t ADCG1Ebits __at(0x114);
// bitfield macros
#define _ADCG1E_CGE0_POSN                                   0x0
#define _ADCG1E_CGE0_POSITION                               0x0
#define _ADCG1E_CGE0_SIZE                                   0x1
#define _ADCG1E_CGE0_LENGTH                                 0x1
#define _ADCG1E_CGE0_MASK                                   0x1
#define _ADCG1E_CGE1_POSN                                   0x1
#define _ADCG1E_CGE1_POSITION                               0x1
#define _ADCG1E_CGE1_SIZE                                   0x1
#define _ADCG1E_CGE1_LENGTH                                 0x1
#define _ADCG1E_CGE1_MASK                                   0x2
#define _ADCG1E_CGE2_POSN                                   0x2
#define _ADCG1E_CGE2_POSITION                               0x2
#define _ADCG1E_CGE2_SIZE                                   0x1
#define _ADCG1E_CGE2_LENGTH                                 0x1
#define _ADCG1E_CGE2_MASK                                   0x4
#define _ADCG1E_CGE3_POSN                                   0x3
#define _ADCG1E_CGE3_POSITION                               0x3
#define _ADCG1E_CGE3_SIZE                                   0x1
#define _ADCG1E_CGE3_LENGTH                                 0x1
#define _ADCG1E_CGE3_MASK                                   0x8
#define _ADCG1E_CGE4_POSN                                   0x4
#define _ADCG1E_CGE4_POSITION                               0x4
#define _ADCG1E_CGE4_SIZE                                   0x1
#define _ADCG1E_CGE4_LENGTH                                 0x1
#define _ADCG1E_CGE4_MASK                                   0x10
#define _ADCG1E_CGE5_POSN                                   0x5
#define _ADCG1E_CGE5_POSITION                               0x5
#define _ADCG1E_CGE5_SIZE                                   0x1
#define _ADCG1E_CGE5_LENGTH                                 0x1
#define _ADCG1E_CGE5_MASK                                   0x20
#define _ADCG1E_CGE6_POSN                                   0x6
#define _ADCG1E_CGE6_POSITION                               0x6
#define _ADCG1E_CGE6_SIZE                                   0x1
#define _ADCG1E_CGE6_LENGTH                                 0x1
#define _ADCG1E_CGE6_MASK                                   0x40
#define _ADCG1E_CGE7_POSN                                   0x7
#define _ADCG1E_CGE7_POSITION                               0x7
#define _ADCG1E_CGE7_SIZE                                   0x1
#define _ADCG1E_CGE7_LENGTH                                 0x1
#define _ADCG1E_CGE7_MASK                                   0x80

// Register: ADCG1F
#define ADCG1F ADCG1F
extern volatile unsigned char           ADCG1F              __at(0x115);
#ifndef _LIB_BUILD
asm("ADCG1F equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGF0                   :1;
        unsigned CGF1                   :1;
        unsigned CGF2                   :1;
        unsigned CGF3                   :1;
        unsigned CGF4                   :1;
        unsigned CGF5                   :1;
        unsigned CGF6                   :1;
        unsigned CGF7                   :1;
    };
} ADCG1Fbits_t;
extern volatile ADCG1Fbits_t ADCG1Fbits __at(0x115);
// bitfield macros
#define _ADCG1F_CGF0_POSN                                   0x0
#define _ADCG1F_CGF0_POSITION                               0x0
#define _ADCG1F_CGF0_SIZE                                   0x1
#define _ADCG1F_CGF0_LENGTH                                 0x1
#define _ADCG1F_CGF0_MASK                                   0x1
#define _ADCG1F_CGF1_POSN                                   0x1
#define _ADCG1F_CGF1_POSITION                               0x1
#define _ADCG1F_CGF1_SIZE                                   0x1
#define _ADCG1F_CGF1_LENGTH                                 0x1
#define _ADCG1F_CGF1_MASK                                   0x2
#define _ADCG1F_CGF2_POSN                                   0x2
#define _ADCG1F_CGF2_POSITION                               0x2
#define _ADCG1F_CGF2_SIZE                                   0x1
#define _ADCG1F_CGF2_LENGTH                                 0x1
#define _ADCG1F_CGF2_MASK                                   0x4
#define _ADCG1F_CGF3_POSN                                   0x3
#define _ADCG1F_CGF3_POSITION                               0x3
#define _ADCG1F_CGF3_SIZE                                   0x1
#define _ADCG1F_CGF3_LENGTH                                 0x1
#define _ADCG1F_CGF3_MASK                                   0x8
#define _ADCG1F_CGF4_POSN                                   0x4
#define _ADCG1F_CGF4_POSITION                               0x4
#define _ADCG1F_CGF4_SIZE                                   0x1
#define _ADCG1F_CGF4_LENGTH                                 0x1
#define _ADCG1F_CGF4_MASK                                   0x10
#define _ADCG1F_CGF5_POSN                                   0x5
#define _ADCG1F_CGF5_POSITION                               0x5
#define _ADCG1F_CGF5_SIZE                                   0x1
#define _ADCG1F_CGF5_LENGTH                                 0x1
#define _ADCG1F_CGF5_MASK                                   0x20
#define _ADCG1F_CGF6_POSN                                   0x6
#define _ADCG1F_CGF6_POSITION                               0x6
#define _ADCG1F_CGF6_SIZE                                   0x1
#define _ADCG1F_CGF6_LENGTH                                 0x1
#define _ADCG1F_CGF6_MASK                                   0x40
#define _ADCG1F_CGF7_POSN                                   0x7
#define _ADCG1F_CGF7_POSITION                               0x7
#define _ADCG1F_CGF7_SIZE                                   0x1
#define _ADCG1F_CGF7_LENGTH                                 0x1
#define _ADCG1F_CGF7_MASK                                   0x80

