garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f56q24.h
// Register: PORTWCLKPPS
#define PORTWCLKPPS PORTWCLKPPS
extern volatile unsigned char           PORTWCLKPPS         __at(0x27F);
#ifndef _LIB_BUILD
asm("PORTWCLKPPS equ 027Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PORTWCLKPPS            :6;
    };
    struct {
        unsigned PORTWCLKPPS0           :1;
        unsigned PORTWCLKPPS1           :1;
        unsigned PORTWCLKPPS2           :1;
        unsigned PORTWCLKPPS3           :1;
        unsigned PORTWCLKPPS4           :1;
        unsigned PORTWCLKPPS5           :1;
    };
} PORTWCLKPPSbits_t;
extern volatile PORTWCLKPPSbits_t PORTWCLKPPSbits __at(0x27F);
// bitfield macros
#define _PORTWCLKPPS_PIN_POSN                               0x0
#define _PORTWCLKPPS_PIN_POSITION                           0x0
#define _PORTWCLKPPS_PIN_SIZE                               0x3
#define _PORTWCLKPPS_PIN_LENGTH                             0x3
#define _PORTWCLKPPS_PIN_MASK                               0x7
#define _PORTWCLKPPS_PORT_POSN                              0x3
#define _PORTWCLKPPS_PORT_POSITION                          0x3
#define _PORTWCLKPPS_PORT_SIZE                              0x3
#define _PORTWCLKPPS_PORT_LENGTH                            0x3
#define _PORTWCLKPPS_PORT_MASK                              0x38
#define _PORTWCLKPPS_PORTWCLKPPS_POSN                       0x0
#define _PORTWCLKPPS_PORTWCLKPPS_POSITION                   0x0
#define _PORTWCLKPPS_PORTWCLKPPS_SIZE                       0x6
#define _PORTWCLKPPS_PORTWCLKPPS_LENGTH                     0x6
#define _PORTWCLKPPS_PORTWCLKPPS_MASK                       0x3F
#define _PORTWCLKPPS_PORTWCLKPPS0_POSN                      0x0
#define _PORTWCLKPPS_PORTWCLKPPS0_POSITION                  0x0
#define _PORTWCLKPPS_PORTWCLKPPS0_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS0_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS0_MASK                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_POSN                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_POSITION                  0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_MASK                      0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_POSN                      0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_POSITION                  0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS2_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS2_MASK                      0x4
#define _PORTWCLKPPS_PORTWCLKPPS3_POSN                      0x3
#define _PORTWCLKPPS_PORTWCLKPPS3_POSITION                  0x3
#define _PORTWCLKPPS_PORTWCLKPPS3_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS3_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS3_MASK                      0x8
#define _PORTWCLKPPS_PORTWCLKPPS4_POSN                      0x4
#define _PORTWCLKPPS_PORTWCLKPPS4_POSITION                  0x4
#define _PORTWCLKPPS_PORTWCLKPPS4_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS4_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS4_MASK                      0x10
#define _PORTWCLKPPS_PORTWCLKPPS5_POSN                      0x5
#define _PORTWCLKPPS_PORTWCLKPPS5_POSITION                  0x5
#define _PORTWCLKPPS_PORTWCLKPPS5_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS5_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS5_MASK                      0x20

// Register: RD0I2C
#define RD0I2C RD0I2C
extern volatile unsigned char           RD0I2C              __at(0x282);
#ifndef _LIB_BUILD
asm("RD0I2C equ 0282h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RD0I2Cbits_t;
extern volatile RD0I2Cbits_t RD0I2Cbits __at(0x282);
// bitfield macros
#define _RD0I2C_TH_POSN                                     0x0
#define _RD0I2C_TH_POSITION                                 0x0
#define _RD0I2C_TH_SIZE                                     0x2
#define _RD0I2C_TH_LENGTH                                   0x2
#define _RD0I2C_TH_MASK                                     0x3
#define _RD0I2C_SLEW_POSN                                   0x6
#define _RD0I2C_SLEW_POSITION                               0x6
#define _RD0I2C_SLEW_SIZE                                   0x2
#define _RD0I2C_SLEW_LENGTH                                 0x2
#define _RD0I2C_SLEW_MASK                                   0xC0
#define _RD0I2C_TH0_POSN                                    0x0
#define _RD0I2C_TH0_POSITION                                0x0
#define _RD0I2C_TH0_SIZE                                    0x1
#define _RD0I2C_TH0_LENGTH                                  0x1
#define _RD0I2C_TH0_MASK                                    0x1
#define _RD0I2C_TH1_POSN                                    0x1
#define _RD0I2C_TH1_POSITION                                0x1
#define _RD0I2C_TH1_SIZE                                    0x1
#define _RD0I2C_TH1_LENGTH                                  0x1
#define _RD0I2C_TH1_MASK                                    0x2
#define _RD0I2C_SLEW0_POSN                                  0x6
#define _RD0I2C_SLEW0_POSITION                              0x6
#define _RD0I2C_SLEW0_SIZE                                  0x1
#define _RD0I2C_SLEW0_LENGTH                                0x1
#define _RD0I2C_SLEW0_MASK                                  0x40
#define _RD0I2C_SLEW1_POSN                                  0x7
#define _RD0I2C_SLEW1_POSITION                              0x7
#define _RD0I2C_SLEW1_SIZE                                  0x1
#define _RD0I2C_SLEW1_LENGTH                                0x1
#define _RD0I2C_SLEW1_MASK                                  0x80
#define _RD0I2C_I2CTH_POSN                                  0x0
#define _RD0I2C_I2CTH_POSITION                              0x0
#define _RD0I2C_I2CTH_SIZE                                  0x2
#define _RD0I2C_I2CTH_LENGTH                                0x2
#define _RD0I2C_I2CTH_MASK                                  0x3
#define _RD0I2C_I2CSLEW_POSN                                0x6
#define _RD0I2C_I2CSLEW_POSITION                            0x6
#define _RD0I2C_I2CSLEW_SIZE                                0x2
#define _RD0I2C_I2CSLEW_LENGTH                              0x2
#define _RD0I2C_I2CSLEW_MASK                                0xC0
#define _RD0I2C_I2CTH0_POSN                                 0x0
#define _RD0I2C_I2CTH0_POSITION                             0x0
#define _RD0I2C_I2CTH0_SIZE                                 0x1
#define _RD0I2C_I2CTH0_LENGTH                               0x1
#define _RD0I2C_I2CTH0_MASK                                 0x1
#define _RD0I2C_I2CTH1_POSN                                 0x1
#define _RD0I2C_I2CTH1_POSITION                             0x1
#define _RD0I2C_I2CTH1_SIZE                                 0x1
#define _RD0I2C_I2CTH1_LENGTH                               0x1
#define _RD0I2C_I2CTH1_MASK                                 0x2
#define _RD0I2C_I2CSLEW0_POSN                               0x6
#define _RD0I2C_I2CSLEW0_POSITION                           0x6
#define _RD0I2C_I2CSLEW0_SIZE                               0x1
#define _RD0I2C_I2CSLEW0_LENGTH                             0x1
#define _RD0I2C_I2CSLEW0_MASK                               0x40
#define _RD0I2C_I2CSLEW1_POSN                               0x7
#define _RD0I2C_I2CSLEW1_POSITION                           0x7
#define _RD0I2C_I2CSLEW1_SIZE                               0x1
#define _RD0I2C_I2CSLEW1_LENGTH                             0x1
#define _RD0I2C_I2CSLEW1_MASK                               0x80

// Register: RD1I2C
#define RD1I2C RD1I2C
extern volatile unsigned char           RD1I2C              __at(0x283);
#ifndef _LIB_BUILD
asm("RD1I2C equ 0283h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RD1I2Cbits_t;
extern volatile RD1I2Cbits_t RD1I2Cbits __at(0x283);
// bitfield macros
#define _RD1I2C_TH_POSN                                     0x0
#define _RD1I2C_TH_POSITION                                 0x0
#define _RD1I2C_TH_SIZE                                     0x2
#define _RD1I2C_TH_LENGTH                                   0x2
#define _RD1I2C_TH_MASK                                     0x3
#define _RD1I2C_SLEW_POSN                                   0x6
#define _RD1I2C_SLEW_POSITION                               0x6
#define _RD1I2C_SLEW_SIZE                                   0x2
#define _RD1I2C_SLEW_LENGTH                                 0x2
#define _RD1I2C_SLEW_MASK                                   0xC0
#define _RD1I2C_TH0_POSN                                    0x0
#define _RD1I2C_TH0_POSITION                                0x0
#define _RD1I2C_TH0_SIZE                                    0x1
#define _RD1I2C_TH0_LENGTH                                  0x1
#define _RD1I2C_TH0_MASK                                    0x1
#define _RD1I2C_TH1_POSN                                    0x1
#define _RD1I2C_TH1_POSITION                                0x1
#define _RD1I2C_TH1_SIZE                                    0x1
#define _RD1I2C_TH1_LENGTH                                  0x1
#define _RD1I2C_TH1_MASK                                    0x2
#define _RD1I2C_SLEW0_POSN                                  0x6
#define _RD1I2C_SLEW0_POSITION                              0x6
#define _RD1I2C_SLEW0_SIZE                                  0x1
#define _RD1I2C_SLEW0_LENGTH                                0x1
#define _RD1I2C_SLEW0_MASK                                  0x40
#define _RD1I2C_SLEW1_POSN                                  0x7
#define _RD1I2C_SLEW1_POSITION                              0x7
#define _RD1I2C_SLEW1_SIZE                                  0x1
#define _RD1I2C_SLEW1_LENGTH                                0x1
#define _RD1I2C_SLEW1_MASK                                  0x80
#define _RD1I2C_I2CTH_POSN                                  0x0
#define _RD1I2C_I2CTH_POSITION                              0x0
#define _RD1I2C_I2CTH_SIZE                                  0x2
#define _RD1I2C_I2CTH_LENGTH                                0x2
#define _RD1I2C_I2CTH_MASK                                  0x3
#define _RD1I2C_I2CSLEW_POSN                                0x6
#define _RD1I2C_I2CSLEW_POSITION                            0x6
#define _RD1I2C_I2CSLEW_SIZE                                0x2
#define _RD1I2C_I2CSLEW_LENGTH                              0x2
#define _RD1I2C_I2CSLEW_MASK                                0xC0
#define _RD1I2C_I2CTH0_POSN                                 0x0
#define _RD1I2C_I2CTH0_POSITION                             0x0
#define _RD1I2C_I2CTH0_SIZE                                 0x1
#define _RD1I2C_I2CTH0_LENGTH                               0x1
#define _RD1I2C_I2CTH0_MASK                                 0x1
#define _RD1I2C_I2CTH1_POSN                                 0x1
#define _RD1I2C_I2CTH1_POSITION                             0x1
#define _RD1I2C_I2CTH1_SIZE                                 0x1
#define _RD1I2C_I2CTH1_LENGTH                               0x1
#define _RD1I2C_I2CTH1_MASK                                 0x2
#define _RD1I2C_I2CSLEW0_POSN                               0x6
#define _RD1I2C_I2CSLEW0_POSITION                           0x6
#define _RD1I2C_I2CSLEW0_SIZE                               0x1
#define _RD1I2C_I2CSLEW0_LENGTH                             0x1
#define _RD1I2C_I2CSLEW0_MASK                               0x40
#define _RD1I2C_I2CSLEW1_POSN                               0x7
#define _RD1I2C_I2CSLEW1_POSITION                           0x7
#define _RD1I2C_I2CSLEW1_SIZE                               0x1
#define _RD1I2C_I2CSLEW1_LENGTH                             0x1
#define _RD1I2C_I2CSLEW1_MASK                               0x80

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x284);
#ifndef _LIB_BUILD
asm("RC3I2C equ 0284h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x284);
// bitfield macros
#define _RC3I2C_TH_POSN                                     0x0
#define _RC3I2C_TH_POSITION                                 0x0
#define _RC3I2C_TH_SIZE                                     0x2
#define _RC3I2C_TH_LENGTH                                   0x2
#define _RC3I2C_TH_MASK                                     0x3
#define _RC3I2C_SLEW_POSN                                   0x6
#define _RC3I2C_SLEW_POSITION                               0x6
#define _RC3I2C_SLEW_SIZE                                   0x2
#define _RC3I2C_SLEW_LENGTH                                 0x2
#define _RC3I2C_SLEW_MASK                                   0xC0
#define _RC3I2C_TH0_POSN                                    0x0
#define _RC3I2C_TH0_POSITION                                0x0
#define _RC3I2C_TH0_SIZE                                    0x1
#define _RC3I2C_TH0_LENGTH                                  0x1
#define _RC3I2C_TH0_MASK                                    0x1
#define _RC3I2C_TH1_POSN                                    0x1
#define _RC3I2C_TH1_POSITION                                0x1
#define _RC3I2C_TH1_SIZE                                    0x1
#define _RC3I2C_TH1_LENGTH                                  0x1
#define _RC3I2C_TH1_MASK                                    0x2
#define _RC3I2C_SLEW0_POSN                                  0x6
#define _RC3I2C_SLEW0_POSITION                              0x6
#define _RC3I2C_SLEW0_SIZE                                  0x1
#define _RC3I2C_SLEW0_LENGTH                                0x1
#define _RC3I2C_SLEW0_MASK                                  0x40
#define _RC3I2C_SLEW1_POSN                                  0x7
#define _RC3I2C_SLEW1_POSITION                              0x7
#define _RC3I2C_SLEW1_SIZE                                  0x1
#define _RC3I2C_SLEW1_LENGTH                                0x1
#define _RC3I2C_SLEW1_MASK                                  0x80
#define _RC3I2C_I2CTH_POSN                                  0x0
#define _RC3I2C_I2CTH_POSITION                              0x0
#define _RC3I2C_I2CTH_SIZE                                  0x2
#define _RC3I2C_I2CTH_LENGTH                                0x2
#define _RC3I2C_I2CTH_MASK                                  0x3
#define _RC3I2C_I2CSLEW_POSN                                0x6
#define _RC3I2C_I2CSLEW_POSITION                            0x6
#define _RC3I2C_I2CSLEW_SIZE                                0x2
#define _RC3I2C_I2CSLEW_LENGTH                              0x2
#define _RC3I2C_I2CSLEW_MASK                                0xC0
#define _RC3I2C_I2CTH0_POSN                                 0x0
#define _RC3I2C_I2CTH0_POSITION                             0x0
#define _RC3I2C_I2CTH0_SIZE                                 0x1
#define _RC3I2C_I2CTH0_LENGTH                               0x1
#define _RC3I2C_I2CTH0_MASK                                 0x1
#define _RC3I2C_I2CTH1_POSN                                 0x1
#define _RC3I2C_I2CTH1_POSITION                             0x1
#define _RC3I2C_I2CTH1_SIZE                                 0x1
#define _RC3I2C_I2CTH1_LENGTH                               0x1
#define _RC3I2C_I2CTH1_MASK                                 0x2
#define _RC3I2C_I2CSLEW0_POSN                               0x6
#define _RC3I2C_I2CSLEW0_POSITION                           0x6
#define _RC3I2C_I2CSLEW0_SIZE                               0x1
#define _RC3I2C_I2CSLEW0_LENGTH                             0x1
#define _RC3I2C_I2CSLEW0_MASK                               0x40
#define _RC3I2C_I2CSLEW1_POSN                               0x7
#define _RC3I2C_I2CSLEW1_POSITION                           0x7
#define _RC3I2C_I2CSLEW1_SIZE                               0x1
#define _RC3I2C_I2CSLEW1_LENGTH                             0x1
#define _RC3I2C_I2CSLEW1_MASK                               0x80

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x285);
#ifndef _LIB_BUILD
asm("RC4I2C equ 0285h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x285);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x2
#define _RC4I2C_SLEW_LENGTH                                 0x2
#define _RC4I2C_SLEW_MASK                                   0xC0
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_SLEW0_POSN                                  0x6
#define _RC4I2C_SLEW0_POSITION                              0x6
#define _RC4I2C_SLEW0_SIZE                                  0x1
#define _RC4I2C_SLEW0_LENGTH                                0x1
#define _RC4I2C_SLEW0_MASK                                  0x40
#define _RC4I2C_SLEW1_POSN                                  0x7
#define _RC4I2C_SLEW1_POSITION                              0x7
#define _RC4I2C_SLEW1_SIZE                                  0x1
#define _RC4I2C_SLEW1_LENGTH                                0x1
#define _RC4I2C_SLEW1_MASK                                  0x80
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x2
#define _RC4I2C_I2CSLEW_LENGTH                              0x2
#define _RC4I2C_I2CSLEW_MASK                                0xC0
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CSLEW0_POSN                               0x6
#define _RC4I2C_I2CSLEW0_POSITION                           0x6
#define _RC4I2C_I2CSLEW0_SIZE                               0x1
#define _RC4I2C_I2CSLEW0_LENGTH                             0x1
#define _RC4I2C_I2CSLEW0_MASK                               0x40
#define _RC4I2C_I2CSLEW1_POSN                               0x7
#define _RC4I2C_I2CSLEW1_POSITION                           0x7
#define _RC4I2C_I2CSLEW1_SIZE                               0x1
#define _RC4I2C_I2CSLEW1_LENGTH                             0x1
#define _RC4I2C_I2CSLEW1_MASK                               0x80

