garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f56q24.h
extern volatile __bit                   SPI2SSPPS1          __at(0x1379);	// @ (0x26F * 8 + 1)
#define                                 SPI2SSPPS1_bit      _BIT_ACCESS(SPI2SSPPS,1)
// SPI2SSPPS<SPI2SSPPS2>
extern volatile __bit                   SPI2SSPPS2          __at(0x137A);	// @ (0x26F * 8 + 2)
#define                                 SPI2SSPPS2_bit      _BIT_ACCESS(SPI2SSPPS,2)
// SPI2SSPPS<SPI2SSPPS3>
extern volatile __bit                   SPI2SSPPS3          __at(0x137B);	// @ (0x26F * 8 + 3)
#define                                 SPI2SSPPS3_bit      _BIT_ACCESS(SPI2SSPPS,3)
// SPI2SSPPS<SPI2SSPPS4>
extern volatile __bit                   SPI2SSPPS4          __at(0x137C);	// @ (0x26F * 8 + 4)
#define                                 SPI2SSPPS4_bit      _BIT_ACCESS(SPI2SSPPS,4)
// SPI2SSPPS<SPI2SSPPS5>
extern volatile __bit                   SPI2SSPPS5          __at(0x137D);	// @ (0x26F * 8 + 5)
#define                                 SPI2SSPPS5_bit      _BIT_ACCESS(SPI2SSPPS,5)
// SPI2INTE<SPI2TCZIE>
extern volatile __bit                   SPI2TCZIE           __at(0x4C6);	// @ (0x98 * 8 + 6)
#define                                 SPI2TCZIE_bit       _BIT_ACCESS(SPI2INTE,6)
// SPI2INTF<SPI2TCZIF>
extern volatile __bit                   SPI2TCZIF           __at(0x4BE);	// @ (0x97 * 8 + 6)
#define                                 SPI2TCZIF_bit       _BIT_ACCESS(SPI2INTF,6)
// SPI2STATUS<SPI2TXBE>
extern volatile __bit                   SPI2TXBE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 SPI2TXBE_bit        _BIT_ACCESS(SPI2STATUS,5)
// PIE11<SPI2TXIE>
extern volatile __bit                   SPI2TXIE            __at(0x25A9);	// @ (0x4B5 * 8 + 1)
#define                                 SPI2TXIE_bit        _BIT_ACCESS(PIE11,1)
// PIR11<SPI2TXIF>
extern volatile __bit                   SPI2TXIF            __at(0x2609);	// @ (0x4C1 * 8 + 1)
#define                                 SPI2TXIF_bit        _BIT_ACCESS(PIR11,1)
// IPR11<SPI2TXIP>
extern volatile __bit                   SPI2TXIP            __at(0x2549);	// @ (0x4A9 * 8 + 1)
#define                                 SPI2TXIP_bit        _BIT_ACCESS(IPR11,1)
// SPI2CON2<SPI2TXR>
extern volatile __bit                   SPI2TXR             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 SPI2TXR_bit         _BIT_ACCESS(SPI2CON2,1)
// SPI2INTE<SPI2TXUIE>
extern volatile __bit                   SPI2TXUIE           __at(0x4C1);	// @ (0x98 * 8 + 1)
#define                                 SPI2TXUIE_bit       _BIT_ACCESS(SPI2INTE,1)
// SPI2INTF<SPI2TXUIF>
extern volatile __bit                   SPI2TXUIF           __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 SPI2TXUIF_bit       _BIT_ACCESS(SPI2INTF,1)
// SPI2STATUS<SPI2TXWE>
extern volatile __bit                   SPI2TXWE            __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 SPI2TXWE_bit        _BIT_ACCESS(SPI2STATUS,7)
// DMAnSPTRL<SPTR0>
extern volatile __bit                   SPTR0               __at(0x798);	// @ (0xF3 * 8 + 0)
#define                                 SPTR0_bit           _BIT_ACCESS(DMAnSPTRL,0)
// DMAnSPTRL<SPTR1>
extern volatile __bit                   SPTR1               __at(0x799);	// @ (0xF3 * 8 + 1)
#define                                 SPTR1_bit           _BIT_ACCESS(DMAnSPTRL,1)
// DMAnSPTRH<SPTR10>
extern volatile __bit                   SPTR10              __at(0x7A2);	// @ (0xF4 * 8 + 2)
#define                                 SPTR10_bit          _BIT_ACCESS(DMAnSPTRH,2)
// DMAnSPTRH<SPTR11>
extern volatile __bit                   SPTR11              __at(0x7A3);	// @ (0xF4 * 8 + 3)
#define                                 SPTR11_bit          _BIT_ACCESS(DMAnSPTRH,3)
// DMAnSPTRH<SPTR12>
extern volatile __bit                   SPTR12              __at(0x7A4);	// @ (0xF4 * 8 + 4)
#define                                 SPTR12_bit          _BIT_ACCESS(DMAnSPTRH,4)
// DMAnSPTRH<SPTR13>
extern volatile __bit                   SPTR13              __at(0x7A5);	// @ (0xF4 * 8 + 5)
#define                                 SPTR13_bit          _BIT_ACCESS(DMAnSPTRH,5)
// DMAnSPTRH<SPTR14>
extern volatile __bit                   SPTR14              __at(0x7A6);	// @ (0xF4 * 8 + 6)
#define                                 SPTR14_bit          _BIT_ACCESS(DMAnSPTRH,6)
// DMAnSPTRH<SPTR15>
extern volatile __bit                   SPTR15              __at(0x7A7);	// @ (0xF4 * 8 + 7)
#define                                 SPTR15_bit          _BIT_ACCESS(DMAnSPTRH,7)
// DMAnSPTRU<SPTR16>
extern volatile __bit                   SPTR16              __at(0x7A8);	// @ (0xF5 * 8 + 0)
#define                                 SPTR16_bit          _BIT_ACCESS(DMAnSPTRU,0)
// DMAnSPTRU<SPTR17>
extern volatile __bit                   SPTR17              __at(0x7A9);	// @ (0xF5 * 8 + 1)
#define                                 SPTR17_bit          _BIT_ACCESS(DMAnSPTRU,1)
// DMAnSPTRU<SPTR18>
extern volatile __bit                   SPTR18              __at(0x7AA);	// @ (0xF5 * 8 + 2)
#define                                 SPTR18_bit          _BIT_ACCESS(DMAnSPTRU,2)
// DMAnSPTRU<SPTR19>
extern volatile __bit                   SPTR19              __at(0x7AB);	// @ (0xF5 * 8 + 3)
#define                                 SPTR19_bit          _BIT_ACCESS(DMAnSPTRU,3)
// DMAnSPTRL<SPTR2>
extern volatile __bit                   SPTR2               __at(0x79A);	// @ (0xF3 * 8 + 2)
#define                                 SPTR2_bit           _BIT_ACCESS(DMAnSPTRL,2)
// DMAnSPTRU<SPTR20>
extern volatile __bit                   SPTR20              __at(0x7AC);	// @ (0xF5 * 8 + 4)
#define                                 SPTR20_bit          _BIT_ACCESS(DMAnSPTRU,4)
// DMAnSPTRU<SPTR21>
extern volatile __bit                   SPTR21              __at(0x7AD);	// @ (0xF5 * 8 + 5)
#define                                 SPTR21_bit          _BIT_ACCESS(DMAnSPTRU,5)
// DMAnSPTRL<SPTR3>
extern volatile __bit                   SPTR3               __at(0x79B);	// @ (0xF3 * 8 + 3)
#define                                 SPTR3_bit           _BIT_ACCESS(DMAnSPTRL,3)
// DMAnSPTRL<SPTR4>
extern volatile __bit                   SPTR4               __at(0x79C);	// @ (0xF3 * 8 + 4)
#define                                 SPTR4_bit           _BIT_ACCESS(DMAnSPTRL,4)
// DMAnSPTRL<SPTR5>
extern volatile __bit                   SPTR5               __at(0x79D);	// @ (0xF3 * 8 + 5)
#define                                 SPTR5_bit           _BIT_ACCESS(DMAnSPTRL,5)
// DMAnSPTRL<SPTR6>
extern volatile __bit                   SPTR6               __at(0x79E);	// @ (0xF3 * 8 + 6)
#define                                 SPTR6_bit           _BIT_ACCESS(DMAnSPTRL,6)
// DMAnSPTRL<SPTR7>
extern volatile __bit                   SPTR7               __at(0x79F);	// @ (0xF3 * 8 + 7)
#define                                 SPTR7_bit           _BIT_ACCESS(DMAnSPTRL,7)
// DMAnSPTRH<SPTR8>
extern volatile __bit                   SPTR8               __at(0x7A0);	// @ (0xF4 * 8 + 0)
#define                                 SPTR8_bit           _BIT_ACCESS(DMAnSPTRH,0)
// DMAnSPTRH<SPTR9>
extern volatile __bit                   SPTR9               __at(0x7A1);	// @ (0xF4 * 8 + 1)
#define                                 SPTR9_bit           _BIT_ACCESS(DMAnSPTRH,1)
// DMAnSSAL<SSA0>
extern volatile __bit                   SSA0                __at(0x7C0);	// @ (0xF8 * 8 + 0)
#define                                 SSA0_bit            _BIT_ACCESS(DMAnSSAL,0)
// DMAnSSAL<SSA1>
extern volatile __bit                   SSA1                __at(0x7C1);	// @ (0xF8 * 8 + 1)
#define                                 SSA1_bit            _BIT_ACCESS(DMAnSSAL,1)
// DMAnSSAH<SSA10>
extern volatile __bit                   SSA10               __at(0x7CA);	// @ (0xF9 * 8 + 2)
#define                                 SSA10_bit           _BIT_ACCESS(DMAnSSAH,2)
// DMAnSSAH<SSA11>
extern volatile __bit                   SSA11               __at(0x7CB);	// @ (0xF9 * 8 + 3)
#define                                 SSA11_bit           _BIT_ACCESS(DMAnSSAH,3)
// DMAnSSAH<SSA12>
extern volatile __bit                   SSA12               __at(0x7CC);	// @ (0xF9 * 8 + 4)
#define                                 SSA12_bit           _BIT_ACCESS(DMAnSSAH,4)
// DMAnSSAH<SSA13>
extern volatile __bit                   SSA13               __at(0x7CD);	// @ (0xF9 * 8 + 5)
#define                                 SSA13_bit           _BIT_ACCESS(DMAnSSAH,5)
// DMAnSSAH<SSA14>
extern volatile __bit                   SSA14               __at(0x7CE);	// @ (0xF9 * 8 + 6)
#define                                 SSA14_bit           _BIT_ACCESS(DMAnSSAH,6)
// DMAnSSAH<SSA15>
extern volatile __bit                   SSA15               __at(0x7CF);	// @ (0xF9 * 8 + 7)
#define                                 SSA15_bit           _BIT_ACCESS(DMAnSSAH,7)
// DMAnSSAU<SSA16>
extern volatile __bit                   SSA16               __at(0x7D0);	// @ (0xFA * 8 + 0)
#define                                 SSA16_bit           _BIT_ACCESS(DMAnSSAU,0)
// DMAnSSAU<SSA17>
extern volatile __bit                   SSA17               __at(0x7D1);	// @ (0xFA * 8 + 1)
#define                                 SSA17_bit           _BIT_ACCESS(DMAnSSAU,1)
// DMAnSSAU<SSA18>
extern volatile __bit                   SSA18               __at(0x7D2);	// @ (0xFA * 8 + 2)
#define                                 SSA18_bit           _BIT_ACCESS(DMAnSSAU,2)
// DMAnSSAU<SSA19>
extern volatile __bit                   SSA19               __at(0x7D3);	// @ (0xFA * 8 + 3)
#define                                 SSA19_bit           _BIT_ACCESS(DMAnSSAU,3)
// DMAnSSAL<SSA2>
extern volatile __bit                   SSA2                __at(0x7C2);	// @ (0xF8 * 8 + 2)
#define                                 SSA2_bit            _BIT_ACCESS(DMAnSSAL,2)
// DMAnSSAU<SSA20>
extern volatile __bit                   SSA20               __at(0x7D4);	// @ (0xFA * 8 + 4)
#define                                 SSA20_bit           _BIT_ACCESS(DMAnSSAU,4)
// DMAnSSAU<SSA21>
extern volatile __bit                   SSA21               __at(0x7D5);	// @ (0xFA * 8 + 5)
#define                                 SSA21_bit           _BIT_ACCESS(DMAnSSAU,5)
// DMAnSSAL<SSA3>
extern volatile __bit                   SSA3                __at(0x7C3);	// @ (0xF8 * 8 + 3)
#define                                 SSA3_bit            _BIT_ACCESS(DMAnSSAL,3)
// DMAnSSAL<SSA4>
extern volatile __bit                   SSA4                __at(0x7C4);	// @ (0xF8 * 8 + 4)
#define                                 SSA4_bit            _BIT_ACCESS(DMAnSSAL,4)
// DMAnSSAL<SSA5>
extern volatile __bit                   SSA5                __at(0x7C5);	// @ (0xF8 * 8 + 5)
#define                                 SSA5_bit            _BIT_ACCESS(DMAnSSAL,5)
// DMAnSSAL<SSA6>
extern volatile __bit                   SSA6                __at(0x7C6);	// @ (0xF8 * 8 + 6)
#define                                 SSA6_bit            _BIT_ACCESS(DMAnSSAL,6)
// DMAnSSAL<SSA7>
extern volatile __bit                   SSA7                __at(0x7C7);	// @ (0xF8 * 8 + 7)
#define                                 SSA7_bit            _BIT_ACCESS(DMAnSSAL,7)
// DMAnSSAH<SSA8>
extern volatile __bit                   SSA8                __at(0x7C8);	// @ (0xF9 * 8 + 0)
#define                                 SSA8_bit            _BIT_ACCESS(DMAnSSAH,0)
// DMAnSSAH<SSA9>
extern volatile __bit                   SSA9                __at(0x7C9);	// @ (0xF9 * 8 + 1)
#define                                 SSA9_bit            _BIT_ACCESS(DMAnSSAH,1)
// DMAnCON1<SSTP>
extern volatile __bit                   SSTP                __at(0x7E0);	// @ (0xFC * 8 + 0)
#define                                 SSTP_bit            _BIT_ACCESS(DMAnCON1,0)
// DMAnSSZL<SSZ0>
extern volatile __bit                   SSZ0                __at(0x7B0);	// @ (0xF6 * 8 + 0)
#define                                 SSZ0_bit            _BIT_ACCESS(DMAnSSZL,0)
// DMAnSSZL<SSZ1>
extern volatile __bit                   SSZ1                __at(0x7B1);	// @ (0xF6 * 8 + 1)
#define                                 SSZ1_bit            _BIT_ACCESS(DMAnSSZL,1)
// DMAnSSZH<SSZ10>
extern volatile __bit                   SSZ10               __at(0x7BA);	// @ (0xF7 * 8 + 2)
#define                                 SSZ10_bit           _BIT_ACCESS(DMAnSSZH,2)
// DMAnSSZH<SSZ11>
extern volatile __bit                   SSZ11               __at(0x7BB);	// @ (0xF7 * 8 + 3)
#define                                 SSZ11_bit           _BIT_ACCESS(DMAnSSZH,3)
// DMAnSSZL<SSZ2>
extern volatile __bit                   SSZ2                __at(0x7B2);	// @ (0xF6 * 8 + 2)
#define                                 SSZ2_bit            _BIT_ACCESS(DMAnSSZL,2)
// DMAnSSZL<SSZ3>
extern volatile __bit                   SSZ3                __at(0x7B3);	// @ (0xF6 * 8 + 3)
#define                                 SSZ3_bit            _BIT_ACCESS(DMAnSSZL,3)
// DMAnSSZL<SSZ4>
extern volatile __bit                   SSZ4                __at(0x7B4);	// @ (0xF6 * 8 + 4)
#define                                 SSZ4_bit            _BIT_ACCESS(DMAnSSZL,4)
// DMAnSSZL<SSZ5>
extern volatile __bit                   SSZ5                __at(0x7B5);	// @ (0xF6 * 8 + 5)
#define                                 SSZ5_bit            _BIT_ACCESS(DMAnSSZL,5)
// DMAnSSZL<SSZ6>
extern volatile __bit                   SSZ6                __at(0x7B6);	// @ (0xF6 * 8 + 6)
#define                                 SSZ6_bit            _BIT_ACCESS(DMAnSSZL,6)
// DMAnSSZL<SSZ7>
extern volatile __bit                   SSZ7                __at(0x7B7);	// @ (0xF6 * 8 + 7)
#define                                 SSZ7_bit            _BIT_ACCESS(DMAnSSZL,7)
// DMAnSSZH<SSZ8>
extern volatile __bit                   SSZ8                __at(0x7B8);	// @ (0xF7 * 8 + 0)
#define                                 SSZ8_bit            _BIT_ACCESS(DMAnSSZH,0)
// DMAnSSZH<SSZ9>
extern volatile __bit                   SSZ9                __at(0x7B9);	// @ (0xF7 * 8 + 1)
#define                                 SSZ9_bit            _BIT_ACCESS(DMAnSSZH,1)
// ADSTAT<STAT2>
extern volatile __bit                   STAT2               __at(0x1FBA);	// @ (0x3F7 * 8 + 2)
#define                                 STAT2_bit           _BIT_ACCESS(ADSTAT,2)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x3E2);	// @ (0x7C * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x2787);	// @ (0x4F0 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x27E0);	// @ (0x4FC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x27E1);	// @ (0x4FC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x27E2);	// @ (0x4FC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x27E3);	// @ (0x4FC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x27E4);	// @ (0x4FC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// STKPTR<STKPTR5>
extern volatile __bit                   STKPTR5             __at(0x27E5);	// @ (0x4FC * 8 + 5)
#define                                 STKPTR5_bit         _BIT_ACCESS(STKPTR,5)
// STKPTR<STKPTR6>
extern volatile __bit                   STKPTR6             __at(0x27E6);	// @ (0x4FC * 8 + 6)
#define                                 STKPTR6_bit         _BIT_ACCESS(STKPTR,6)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x2786);	// @ (0x4F0 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// ADSTPTL<STPT0>
extern volatile __bit                   STPT0               __at(0x1EF8);	// @ (0x3DF * 8 + 0)
#define                                 STPT0_bit           _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<STPT1>
extern volatile __bit                   STPT1               __at(0x1EF9);	// @ (0x3DF * 8 + 1)
#define                                 STPT1_bit           _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<STPT10>
extern volatile __bit                   STPT10              __at(0x1F02);	// @ (0x3E0 * 8 + 2)
#define                                 STPT10_bit          _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<STPT11>
extern volatile __bit                   STPT11              __at(0x1F03);	// @ (0x3E0 * 8 + 3)
#define                                 STPT11_bit          _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<STPT12>
extern volatile __bit                   STPT12              __at(0x1F04);	// @ (0x3E0 * 8 + 4)
#define                                 STPT12_bit          _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<STPT13>
extern volatile __bit                   STPT13              __at(0x1F05);	// @ (0x3E0 * 8 + 5)
#define                                 STPT13_bit          _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<STPT15>
extern volatile __bit                   STPT15              __at(0x1F06);	// @ (0x3E0 * 8 + 6)
#define                                 STPT15_bit          _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<STPT16>
extern volatile __bit                   STPT16              __at(0x1F07);	// @ (0x3E0 * 8 + 7)
#define                                 STPT16_bit          _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<STPT2>
extern volatile __bit                   STPT2               __at(0x1EFA);	// @ (0x3DF * 8 + 2)
#define                                 STPT2_bit           _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<STPT3>
extern volatile __bit                   STPT3               __at(0x1EFB);	// @ (0x3DF * 8 + 3)
#define                                 STPT3_bit           _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x1EFC);	// @ (0x3DF * 8 + 4)
#define                                 STPT4_bit           _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x1EFD);	// @ (0x3DF * 8 + 5)
#define                                 STPT5_bit           _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x1EFE);	// @ (0x3DF * 8 + 6)
#define                                 STPT6_bit           _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x1EFF);	// @ (0x3DF * 8 + 7)
#define                                 STPT7_bit           _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x1F00);	// @ (0x3E0 * 8 + 0)
#define                                 STPT8_bit           _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x1F01);	// @ (0x3E0 * 8 + 1)
#define                                 STPT9_bit           _BIT_ACCESS(ADSTPTH,1)
// CWG1STR<STRA>
extern volatile __bit                   STRA                __at(0x1E20);	// @ (0x3C4 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1STR,0)
// CWG1STR<STRB>
extern volatile __bit                   STRB                __at(0x1E21);	// @ (0x3C4 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1STR,1)
// CWG1STR<STRC>
extern volatile __bit                   STRC                __at(0x1E22);	// @ (0x3C4 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1STR,2)
// CWG1STR<STRD>
extern volatile __bit                   STRD                __at(0x1E23);	// @ (0x3C4 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1STR,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// PIE0<SWIE>
extern volatile __bit                   SWIE                __at(0x2550);	// @ (0x4AA * 8 + 0)
#define                                 SWIE_bit            _BIT_ACCESS(PIE0,0)
// PIR0<SWIF>
extern volatile __bit                   SWIF                __at(0x25B0);	// @ (0x4B6 * 8 + 0)
#define                                 SWIF_bit            _BIT_ACCESS(PIR0,0)
// IPR0<SWIP>
extern volatile __bit                   SWIP                __at(0x24F0);	// @ (0x49E * 8 + 0)
#define                                 SWIP_bit            _BIT_ACCESS(IPR0,0)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x317);	// @ (0x62 * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x1208);	// @ (0x241 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x1209);	// @ (0x241 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x120A);	// @ (0x241 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x120B);	// @ (0x241 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0x120C);	// @ (0x241 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// T0CKIPPS<T0CKIPPS5>
extern volatile __bit                   T0CKIPPS5           __at(0x120D);	// @ (0x241 * 8 + 5)
#define                                 T0CKIPPS5_bit       _BIT_ACCESS(T0CKIPPS,5)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x18D8);	// @ (0x31B * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x18D9);	// @ (0x31B * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x18DA);	// @ (0x31B * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x18DB);	// @ (0x31B * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x18DD);	// @ (0x31B * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0x18DE);	// @ (0x31B * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
