garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f56q24.h
extern volatile __bit                   TU16BTMRT6          __at(0x1D96);	// @ (0x3B2 * 8 + 6)
#define                                 TU16BTMRT6_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMRT7>
extern volatile __bit                   TU16BTMRT7          __at(0x1D97);	// @ (0x3B2 * 8 + 7)
#define                                 TU16BTMRT7_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BCON0<TU16BZIE>
extern volatile __bit                   TU16BZIE            __at(0x1D59);	// @ (0x3AB * 8 + 1)
#define                                 TU16BZIE_bit        _BIT_ACCESS(TU16BCON0,1)
// TU16BCON1<TU16BZIF>
extern volatile __bit                   TU16BZIF            __at(0x1D61);	// @ (0x3AC * 8 + 1)
#define                                 TU16BZIF_bit        _BIT_ACCESS(TU16BCON1,1)
// TUIN0PPS<TUIN0PPS0>
extern volatile __bit                   TUIN0PPS0           __at(0x13C0);	// @ (0x278 * 8 + 0)
#define                                 TUIN0PPS0_bit       _BIT_ACCESS(TUIN0PPS,0)
// TUIN0PPS<TUIN0PPS1>
extern volatile __bit                   TUIN0PPS1           __at(0x13C1);	// @ (0x278 * 8 + 1)
#define                                 TUIN0PPS1_bit       _BIT_ACCESS(TUIN0PPS,1)
// TUIN0PPS<TUIN0PPS2>
extern volatile __bit                   TUIN0PPS2           __at(0x13C2);	// @ (0x278 * 8 + 2)
#define                                 TUIN0PPS2_bit       _BIT_ACCESS(TUIN0PPS,2)
// TUIN0PPS<TUIN0PPS3>
extern volatile __bit                   TUIN0PPS3           __at(0x13C3);	// @ (0x278 * 8 + 3)
#define                                 TUIN0PPS3_bit       _BIT_ACCESS(TUIN0PPS,3)
// TUIN0PPS<TUIN0PPS4>
extern volatile __bit                   TUIN0PPS4           __at(0x13C4);	// @ (0x278 * 8 + 4)
#define                                 TUIN0PPS4_bit       _BIT_ACCESS(TUIN0PPS,4)
// TUIN0PPS<TUIN0PPS5>
extern volatile __bit                   TUIN0PPS5           __at(0x13C5);	// @ (0x278 * 8 + 5)
#define                                 TUIN0PPS5_bit       _BIT_ACCESS(TUIN0PPS,5)
// TUIN1PPS<TUIN1PPS0>
extern volatile __bit                   TUIN1PPS0           __at(0x13C8);	// @ (0x279 * 8 + 0)
#define                                 TUIN1PPS0_bit       _BIT_ACCESS(TUIN1PPS,0)
// TUIN1PPS<TUIN1PPS1>
extern volatile __bit                   TUIN1PPS1           __at(0x13C9);	// @ (0x279 * 8 + 1)
#define                                 TUIN1PPS1_bit       _BIT_ACCESS(TUIN1PPS,1)
// TUIN1PPS<TUIN1PPS2>
extern volatile __bit                   TUIN1PPS2           __at(0x13CA);	// @ (0x279 * 8 + 2)
#define                                 TUIN1PPS2_bit       _BIT_ACCESS(TUIN1PPS,2)
// TUIN1PPS<TUIN1PPS3>
extern volatile __bit                   TUIN1PPS3           __at(0x13CB);	// @ (0x279 * 8 + 3)
#define                                 TUIN1PPS3_bit       _BIT_ACCESS(TUIN1PPS,3)
// TUIN1PPS<TUIN1PPS4>
extern volatile __bit                   TUIN1PPS4           __at(0x13CC);	// @ (0x279 * 8 + 4)
#define                                 TUIN1PPS4_bit       _BIT_ACCESS(TUIN1PPS,4)
// TUIN1PPS<TUIN1PPS5>
extern volatile __bit                   TUIN1PPS5           __at(0x13CD);	// @ (0x279 * 8 + 5)
#define                                 TUIN1PPS5_bit       _BIT_ACCESS(TUIN1PPS,5)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x580);	// @ (0xB0 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x581);	// @ (0xB0 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x582);	// @ (0xB0 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x583);	// @ (0xB0 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x584);	// @ (0xB0 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x585);	// @ (0xB0 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x1606);	// @ (0x2C0 * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x1632);	// @ (0x2C6 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x1636);	// @ (0x2C6 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x1645);	// @ (0x2C8 * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x163D);	// @ (0x2C7 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x1607);	// @ (0x2C0 * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1609);	// @ (0x2C1 * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x1613);	// @ (0x2C2 * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x1644);	// @ (0x2C8 * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x163C);	// @ (0x2C7 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// U1CTSPPS<U1CTSPPS0>
extern volatile __bit                   U1CTSPPS0           __at(0x1398);	// @ (0x273 * 8 + 0)
#define                                 U1CTSPPS0_bit       _BIT_ACCESS(U1CTSPPS,0)
// U1CTSPPS<U1CTSPPS1>
extern volatile __bit                   U1CTSPPS1           __at(0x1399);	// @ (0x273 * 8 + 1)
#define                                 U1CTSPPS1_bit       _BIT_ACCESS(U1CTSPPS,1)
// U1CTSPPS<U1CTSPPS2>
extern volatile __bit                   U1CTSPPS2           __at(0x139A);	// @ (0x273 * 8 + 2)
#define                                 U1CTSPPS2_bit       _BIT_ACCESS(U1CTSPPS,2)
// U1CTSPPS<U1CTSPPS3>
extern volatile __bit                   U1CTSPPS3           __at(0x139B);	// @ (0x273 * 8 + 3)
#define                                 U1CTSPPS3_bit       _BIT_ACCESS(U1CTSPPS,3)
// U1CTSPPS<U1CTSPPS4>
extern volatile __bit                   U1CTSPPS4           __at(0x139C);	// @ (0x273 * 8 + 4)
#define                                 U1CTSPPS4_bit       _BIT_ACCESS(U1CTSPPS,4)
// U1CTSPPS<U1CTSPPS5>
extern volatile __bit                   U1CTSPPS5           __at(0x139D);	// @ (0x273 * 8 + 5)
#define                                 U1CTSPPS5_bit       _BIT_ACCESS(U1CTSPPS,5)
// PIE4<U1EIE>
extern volatile __bit                   U1EIE               __at(0x2572);	// @ (0x4AE * 8 + 2)
#define                                 U1EIE_bit           _BIT_ACCESS(PIE4,2)
// PIR4<U1EIF>
extern volatile __bit                   U1EIF               __at(0x25D2);	// @ (0x4BA * 8 + 2)
#define                                 U1EIF_bit           _BIT_ACCESS(PIR4,2)
// IPR4<U1EIP>
extern volatile __bit                   U1EIP               __at(0x2512);	// @ (0x4A2 * 8 + 2)
#define                                 U1EIP_bit           _BIT_ACCESS(IPR4,2)
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0x1643);	// @ (0x2C8 * 8 + 3)
#define                                 U1FERIE_bit         _BIT_ACCESS(U1ERRIE,3)
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0x163B);	// @ (0x2C7 * 8 + 3)
#define                                 U1FERIF_bit         _BIT_ACCESS(U1ERRIR,3)
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0x1610);	// @ (0x2C2 * 8 + 0)
#define                                 U1FLO0_bit          _BIT_ACCESS(U1CON2,0)
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0x1611);	// @ (0x2C2 * 8 + 1)
#define                                 U1FLO1_bit          _BIT_ACCESS(U1CON2,1)
// PIE4<U1IE>
extern volatile __bit                   U1IE                __at(0x2573);	// @ (0x4AE * 8 + 3)
#define                                 U1IE_bit            _BIT_ACCESS(PIE4,3)
// PIR4<U1IF>
extern volatile __bit                   U1IF                __at(0x25D3);	// @ (0x4BA * 8 + 3)
#define                                 U1IF_bit            _BIT_ACCESS(PIR4,3)
// IPR4<U1IP>
extern volatile __bit                   U1IP                __at(0x2513);	// @ (0x4A2 * 8 + 3)
#define                                 U1IP_bit            _BIT_ACCESS(IPR4,3)
// PMD3<U1MD>
extern volatile __bit                   U1MD                __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 U1MD_bit            _BIT_ACCESS(PMD3,6)
// U1CON0<U1MODE0>
extern volatile __bit                   U1MODE0             __at(0x1600);	// @ (0x2C0 * 8 + 0)
#define                                 U1MODE0_bit         _BIT_ACCESS(U1CON0,0)
// U1CON0<U1MODE1>
extern volatile __bit                   U1MODE1             __at(0x1601);	// @ (0x2C0 * 8 + 1)
#define                                 U1MODE1_bit         _BIT_ACCESS(U1CON0,1)
// U1CON0<U1MODE2>
extern volatile __bit                   U1MODE2             __at(0x1602);	// @ (0x2C0 * 8 + 2)
#define                                 U1MODE2_bit         _BIT_ACCESS(U1CON0,2)
// U1CON0<U1MODE3>
extern volatile __bit                   U1MODE3             __at(0x1603);	// @ (0x2C0 * 8 + 3)
#define                                 U1MODE3_bit         _BIT_ACCESS(U1CON0,3)
// U1CON1<U1ON>
extern volatile __bit                   U1ON                __at(0x160F);	// @ (0x2C1 * 8 + 7)
#define                                 U1ON_bit            _BIT_ACCESS(U1CON1,7)
// U1ERRIE<U1PERIE>
extern volatile __bit                   U1PERIE             __at(0x1646);	// @ (0x2C8 * 8 + 6)
#define                                 U1PERIE_bit         _BIT_ACCESS(U1ERRIE,6)
// U1ERRIR<U1PERIF>
extern volatile __bit                   U1PERIF             __at(0x163E);	// @ (0x2C7 * 8 + 6)
#define                                 U1PERIF_bit         _BIT_ACCESS(U1ERRIR,6)
// U1FIFO<U1RCIDL>
extern volatile __bit                   U1RCIDL             __at(0x162B);	// @ (0x2C5 * 8 + 3)
#define                                 U1RCIDL_bit         _BIT_ACCESS(U1FIFO,3)
// U1CON2<U1RUNOVF>
extern volatile __bit                   U1RUNOVF            __at(0x1617);	// @ (0x2C2 * 8 + 7)
#define                                 U1RUNOVF_bit        _BIT_ACCESS(U1CON2,7)
// U1FIFO<U1RXBE>
extern volatile __bit                   U1RXBE              __at(0x1629);	// @ (0x2C5 * 8 + 1)
#define                                 U1RXBE_bit          _BIT_ACCESS(U1FIFO,1)
// U1FIFO<U1RXBF>
extern volatile __bit                   U1RXBF              __at(0x1628);	// @ (0x2C5 * 8 + 0)
#define                                 U1RXBF_bit          _BIT_ACCESS(U1FIFO,0)
// U1CON1<U1RXBIMD>
extern volatile __bit                   U1RXBIMD            __at(0x160B);	// @ (0x2C1 * 8 + 3)
#define                                 U1RXBIMD_bit        _BIT_ACCESS(U1CON1,3)
// U1ERRIE<U1RXBKIE>
extern volatile __bit                   U1RXBKIE            __at(0x1642);	// @ (0x2C8 * 8 + 2)
#define                                 U1RXBKIE_bit        _BIT_ACCESS(U1ERRIE,2)
// U1ERRIR<U1RXBKIF>
extern volatile __bit                   U1RXBKIF            __at(0x163A);	// @ (0x2C7 * 8 + 2)
#define                                 U1RXBKIF_bit        _BIT_ACCESS(U1ERRIR,2)
// U1CON0<U1RXEN>
extern volatile __bit                   U1RXEN              __at(0x1604);	// @ (0x2C0 * 8 + 4)
#define                                 U1RXEN_bit          _BIT_ACCESS(U1CON0,4)
// U1ERRIE<U1RXFOIE>
extern volatile __bit                   U1RXFOIE            __at(0x1641);	// @ (0x2C8 * 8 + 1)
#define                                 U1RXFOIE_bit        _BIT_ACCESS(U1ERRIE,1)
// U1ERRIR<U1RXFOIF>
extern volatile __bit                   U1RXFOIF            __at(0x1639);	// @ (0x2C7 * 8 + 1)
#define                                 U1RXFOIF_bit        _BIT_ACCESS(U1ERRIR,1)
// U1FIFO<U1RXIDL>
extern volatile __bit                   U1RXIDL             __at(0x162B);	// @ (0x2C5 * 8 + 3)
#define                                 U1RXIDL_bit         _BIT_ACCESS(U1FIFO,3)
// PIE4<U1RXIE>
extern volatile __bit                   U1RXIE              __at(0x2570);	// @ (0x4AE * 8 + 0)
#define                                 U1RXIE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x25D0);	// @ (0x4BA * 8 + 0)
#define                                 U1RXIF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x2510);	// @ (0x4A2 * 8 + 0)
#define                                 U1RXIP_bit          _BIT_ACCESS(IPR4,0)
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0x1616);	// @ (0x2C2 * 8 + 6)
#define                                 U1RXPOL_bit         _BIT_ACCESS(U1CON2,6)
// U1RXPPS<U1RXPPS0>
extern volatile __bit                   U1RXPPS0            __at(0x1390);	// @ (0x272 * 8 + 0)
#define                                 U1RXPPS0_bit        _BIT_ACCESS(U1RXPPS,0)
// U1RXPPS<U1RXPPS1>
extern volatile __bit                   U1RXPPS1            __at(0x1391);	// @ (0x272 * 8 + 1)
#define                                 U1RXPPS1_bit        _BIT_ACCESS(U1RXPPS,1)
// U1RXPPS<U1RXPPS2>
extern volatile __bit                   U1RXPPS2            __at(0x1392);	// @ (0x272 * 8 + 2)
#define                                 U1RXPPS2_bit        _BIT_ACCESS(U1RXPPS,2)
// U1RXPPS<U1RXPPS3>
extern volatile __bit                   U1RXPPS3            __at(0x1393);	// @ (0x272 * 8 + 3)
#define                                 U1RXPPS3_bit        _BIT_ACCESS(U1RXPPS,3)
// U1RXPPS<U1RXPPS4>
extern volatile __bit                   U1RXPPS4            __at(0x1394);	// @ (0x272 * 8 + 4)
#define                                 U1RXPPS4_bit        _BIT_ACCESS(U1RXPPS,4)
// U1RXPPS<U1RXPPS5>
extern volatile __bit                   U1RXPPS5            __at(0x1395);	// @ (0x272 * 8 + 5)
#define                                 U1RXPPS5_bit        _BIT_ACCESS(U1RXPPS,5)
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0x1608);	// @ (0x2C1 * 8 + 0)
#define                                 U1SENDB_bit         _BIT_ACCESS(U1CON1,0)
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0x1614);	// @ (0x2C2 * 8 + 4)
#define                                 U1STP0_bit          _BIT_ACCESS(U1CON2,4)
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0x1615);	// @ (0x2C2 * 8 + 5)
#define                                 U1STP1_bit          _BIT_ACCESS(U1CON2,5)
// U1FIFO<U1STPMD>
extern volatile __bit                   U1STPMD             __at(0x162E);	// @ (0x2C5 * 8 + 6)
#define                                 U1STPMD_bit         _BIT_ACCESS(U1FIFO,6)
// U1FIFO<U1TXBE>
extern volatile __bit                   U1TXBE              __at(0x162D);	// @ (0x2C5 * 8 + 5)
#define                                 U1TXBE_bit          _BIT_ACCESS(U1FIFO,5)
// U1FIFO<U1TXBF>
extern volatile __bit                   U1TXBF              __at(0x162C);	// @ (0x2C5 * 8 + 4)
#define                                 U1TXBF_bit          _BIT_ACCESS(U1FIFO,4)
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0x1640);	// @ (0x2C8 * 8 + 0)
#define                                 U1TXCIE_bit         _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0x1638);	// @ (0x2C7 * 8 + 0)
#define                                 U1TXCIF_bit         _BIT_ACCESS(U1ERRIR,0)
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0x1605);	// @ (0x2C0 * 8 + 5)
#define                                 U1TXEN_bit          _BIT_ACCESS(U1CON0,5)
// PIE4<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x2571);	// @ (0x4AE * 8 + 1)
#define                                 U1TXIE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x25D1);	// @ (0x4BA * 8 + 1)
#define                                 U1TXIF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<U1TXIP>
extern volatile __bit                   U1TXIP              __at(0x2511);	// @ (0x4A2 * 8 + 1)
#define                                 U1TXIP_bit          _BIT_ACCESS(IPR4,1)
// U1ERRIE<U1TXMTIE>
extern volatile __bit                   U1TXMTIE            __at(0x1647);	// @ (0x2C8 * 8 + 7)
#define                                 U1TXMTIE_bit        _BIT_ACCESS(U1ERRIE,7)
// U1ERRIR<U1TXMTIF>
extern volatile __bit                   U1TXMTIF            __at(0x163F);	// @ (0x2C7 * 8 + 7)
#define                                 U1TXMTIF_bit        _BIT_ACCESS(U1ERRIR,7)
// U1CON2<U1TXPOL>
extern volatile __bit                   U1TXPOL             __at(0x1612);	// @ (0x2C2 * 8 + 2)
#define                                 U1TXPOL_bit         _BIT_ACCESS(U1CON2,2)
// U1FIFO<U1TXWRE>
extern volatile __bit                   U1TXWRE             __at(0x162F);	// @ (0x2C5 * 8 + 7)
#define                                 U1TXWRE_bit         _BIT_ACCESS(U1FIFO,7)
// U1CON1<U1WUE>
extern volatile __bit                   U1WUE               __at(0x160C);	// @ (0x2C1 * 8 + 4)
#define                                 U1WUE_bit           _BIT_ACCESS(U1CON1,4)
// U1UIR<U1WUIF>
extern volatile __bit                   U1WUIF              __at(0x1637);	// @ (0x2C6 * 8 + 7)
#define                                 U1WUIF_bit          _BIT_ACCESS(U1UIR,7)
// U1FIFO<U1XON>
extern volatile __bit                   U1XON               __at(0x162A);	// @ (0x2C5 * 8 + 2)
#define                                 U1XON_bit           _BIT_ACCESS(U1FIFO,2)
// U2CON0<U2ABDEN>
extern volatile __bit                   U2ABDEN             __at(0x169E);	// @ (0x2D3 * 8 + 6)
#define                                 U2ABDEN_bit         _BIT_ACCESS(U2CON0,6)
// U2UIR<U2ABDIE>
extern volatile __bit                   U2ABDIE             __at(0x16CA);	// @ (0x2D9 * 8 + 2)
#define                                 U2ABDIE_bit         _BIT_ACCESS(U2UIR,2)
// U2UIR<U2ABDIF>
extern volatile __bit                   U2ABDIF             __at(0x16CE);	// @ (0x2D9 * 8 + 6)
#define                                 U2ABDIF_bit         _BIT_ACCESS(U2UIR,6)
// U2ERRIE<U2ABDOVE>
extern volatile __bit                   U2ABDOVE            __at(0x16DD);	// @ (0x2DB * 8 + 5)
#define                                 U2ABDOVE_bit        _BIT_ACCESS(U2ERRIE,5)
// U2ERRIR<U2ABDOVF>
extern volatile __bit                   U2ABDOVF            __at(0x16D5);	// @ (0x2DA * 8 + 5)
#define                                 U2ABDOVF_bit        _BIT_ACCESS(U2ERRIR,5)
// U2CON0<U2BRGS>
extern volatile __bit                   U2BRGS              __at(0x169F);	// @ (0x2D3 * 8 + 7)
#define                                 U2BRGS_bit          _BIT_ACCESS(U2CON0,7)
// U2CON1<U2BRKOVR>
extern volatile __bit                   U2BRKOVR            __at(0x16A1);	// @ (0x2D4 * 8 + 1)
#define                                 U2BRKOVR_bit        _BIT_ACCESS(U2CON1,1)
// U2ERRIE<U2CERIE>
extern volatile __bit                   U2CERIE             __at(0x16DC);	// @ (0x2DB * 8 + 4)
#define                                 U2CERIE_bit         _BIT_ACCESS(U2ERRIE,4)
// U2ERRIR<U2CERIF>
extern volatile __bit                   U2CERIF             __at(0x16D4);	// @ (0x2DA * 8 + 4)
#define                                 U2CERIF_bit         _BIT_ACCESS(U2ERRIR,4)
// U2CTSPPS<U2CTSPPS0>
extern volatile __bit                   U2CTSPPS0           __at(0x13A8);	// @ (0x275 * 8 + 0)
#define                                 U2CTSPPS0_bit       _BIT_ACCESS(U2CTSPPS,0)
// U2CTSPPS<U2CTSPPS1>
extern volatile __bit                   U2CTSPPS1           __at(0x13A9);	// @ (0x275 * 8 + 1)
#define                                 U2CTSPPS1_bit       _BIT_ACCESS(U2CTSPPS,1)
// U2CTSPPS<U2CTSPPS2>
extern volatile __bit                   U2CTSPPS2           __at(0x13AA);	// @ (0x275 * 8 + 2)
#define                                 U2CTSPPS2_bit       _BIT_ACCESS(U2CTSPPS,2)
// U2CTSPPS<U2CTSPPS3>
extern volatile __bit                   U2CTSPPS3           __at(0x13AB);	// @ (0x275 * 8 + 3)
#define                                 U2CTSPPS3_bit       _BIT_ACCESS(U2CTSPPS,3)
// U2CTSPPS<U2CTSPPS4>
extern volatile __bit                   U2CTSPPS4           __at(0x13AC);	// @ (0x275 * 8 + 4)
#define                                 U2CTSPPS4_bit       _BIT_ACCESS(U2CTSPPS,4)
// U2CTSPPS<U2CTSPPS5>
extern volatile __bit                   U2CTSPPS5           __at(0x13AD);	// @ (0x275 * 8 + 5)
#define                                 U2CTSPPS5_bit       _BIT_ACCESS(U2CTSPPS,5)
// PIE8<U2EIE>
extern volatile __bit                   U2EIE               __at(0x2592);	// @ (0x4B2 * 8 + 2)
#define                                 U2EIE_bit           _BIT_ACCESS(PIE8,2)
// PIR8<U2EIF>
extern volatile __bit                   U2EIF               __at(0x25F2);	// @ (0x4BE * 8 + 2)
#define                                 U2EIF_bit           _BIT_ACCESS(PIR8,2)
// IPR8<U2EIP>
extern volatile __bit                   U2EIP               __at(0x2532);	// @ (0x4A6 * 8 + 2)
#define                                 U2EIP_bit           _BIT_ACCESS(IPR8,2)
// U2ERRIE<U2FERIE>
extern volatile __bit                   U2FERIE             __at(0x16DB);	// @ (0x2DB * 8 + 3)
#define                                 U2FERIE_bit         _BIT_ACCESS(U2ERRIE,3)
// U2ERRIR<U2FERIF>
extern volatile __bit                   U2FERIF             __at(0x16D3);	// @ (0x2DA * 8 + 3)
#define                                 U2FERIF_bit         _BIT_ACCESS(U2ERRIR,3)
// U2CON2<U2FLO0>
extern volatile __bit                   U2FLO0              __at(0x16A8);	// @ (0x2D5 * 8 + 0)
#define                                 U2FLO0_bit          _BIT_ACCESS(U2CON2,0)
// U2CON2<U2FLO1>
extern volatile __bit                   U2FLO1              __at(0x16A9);	// @ (0x2D5 * 8 + 1)
#define                                 U2FLO1_bit          _BIT_ACCESS(U2CON2,1)
// PIE8<U2IE>
extern volatile __bit                   U2IE                __at(0x2593);	// @ (0x4B2 * 8 + 3)
#define                                 U2IE_bit            _BIT_ACCESS(PIE8,3)
// PIR8<U2IF>
extern volatile __bit                   U2IF                __at(0x25F3);	// @ (0x4BE * 8 + 3)
#define                                 U2IF_bit            _BIT_ACCESS(PIR8,3)
// IPR8<U2IP>
extern volatile __bit                   U2IP                __at(0x2533);	// @ (0x4A6 * 8 + 3)
#define                                 U2IP_bit            _BIT_ACCESS(IPR8,3)
// PMD3<U2MD>
extern volatile __bit                   U2MD                __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 U2MD_bit            _BIT_ACCESS(PMD3,7)
// U2CON0<U2MODE0>
